{"keras_version": "1.2.0", "class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"input_dtype": "float32", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001f<ipython-input-25-183965872745>\u00da\b<lambda>\u0002\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "trainable": true, "name": "lambda_2", "output_shape_type": "raw", "arguments": {}, "function_type": "lambda", "output_shape": null, "batch_input_shape": [null, 16, 32, 3]}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "nb_filter": 32, "activation": "relu", "b_constraint": null, "bias": true, "nb_row": 3, "dim_ordering": "tf", "batch_input_shape": [null, 16, 32, 3], "nb_col": 3, "activity_regularizer": null, "input_dtype": "float32", "border_mode": "valid", "name": "convolution2d_3", "b_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "subsample": [1, 1], "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "trainable": true, "name": "maxpooling2d_3", "strides": [2, 2], "dim_ordering": "tf", "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_3"}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "nb_filter": 32, "activation": "relu", "b_constraint": null, "nb_row": 3, "W_constraint": null, "dim_ordering": "tf", "trainable": true, "nb_col": 3, "activity_regularizer": null, "border_mode": "valid", "name": "convolution2d_4", "b_regularizer": null, "bias": true, "subsample": [1, 1], "init": "glorot_uniform"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "trainable": true, "name": "maxpooling2d_4", "strides": [2, 2], "dim_ordering": "tf", "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_4"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_2"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "output_dim": 128, "b_constraint": null, "activity_regularizer": null, "bias": true, "input_dim": 384, "trainable": true, "name": "dense_3", "b_regularizer": null, "W_constraint": null, "activation": "linear", "init": "glorot_uniform"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "output_dim": 1, "b_constraint": null, "activity_regularizer": null, "bias": true, "input_dim": 128, "trainable": true, "name": "dense_4", "b_regularizer": null, "W_constraint": null, "activation": "linear", "init": "glorot_uniform"}}]}