{"class_name": "Sequential", "keras_version": "1.2.0", "config": [{"class_name": "Lambda", "config": {"batch_input_shape": [null, 20, 40, 3], "arguments": {}, "input_dtype": "float32", "output_shape_type": "raw", "function_type": "lambda", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001f<ipython-input-15-e02e1bc394a6>\u00da\b<lambda>\u0002\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "name": "lambda_1", "trainable": true, "output_shape": null}}, {"class_name": "Convolution2D", "config": {"bias": true, "nb_row": 8, "W_constraint": null, "border_mode": "same", "b_regularizer": null, "subsample": [4, 4], "init": "glorot_uniform", "nb_col": 8, "W_regularizer": null, "nb_filter": 16, "b_constraint": null, "dim_ordering": "tf", "name": "convolution2d_1", "activity_regularizer": null, "trainable": true, "activation": "linear"}}, {"class_name": "ELU", "config": {"name": "elu_1", "alpha": 1.0, "trainable": true}}, {"class_name": "Convolution2D", "config": {"bias": true, "nb_row": 5, "W_constraint": null, "border_mode": "same", "b_regularizer": null, "subsample": [2, 2], "init": "glorot_uniform", "nb_col": 5, "W_regularizer": null, "nb_filter": 32, "b_constraint": null, "dim_ordering": "tf", "name": "convolution2d_2", "activity_regularizer": null, "trainable": true, "activation": "linear"}}, {"class_name": "ELU", "config": {"name": "elu_2", "alpha": 1.0, "trainable": true}}, {"class_name": "Convolution2D", "config": {"bias": true, "nb_row": 5, "W_constraint": null, "border_mode": "same", "b_regularizer": null, "subsample": [2, 2], "init": "glorot_uniform", "nb_col": 5, "W_regularizer": null, "nb_filter": 64, "b_constraint": null, "dim_ordering": "tf", "name": "convolution2d_3", "activity_regularizer": null, "trainable": true, "activation": "linear"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.2, "trainable": true}}, {"class_name": "ELU", "config": {"name": "elu_3", "alpha": 1.0, "trainable": true}}, {"class_name": "Dense", "config": {"W_regularizer": null, "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "input_dim": 384, "trainable": true, "output_dim": 512, "name": "dense_1", "activation": "linear", "activity_regularizer": null, "bias": true, "b_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "p": 0.5, "trainable": true}}, {"class_name": "ELU", "config": {"name": "elu_4", "alpha": 1.0, "trainable": true}}, {"class_name": "Dense", "config": {"W_regularizer": null, "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "input_dim": 512, "trainable": true, "output_dim": 1, "name": "dense_2", "activation": "linear", "activity_regularizer": null, "bias": true, "b_constraint": null}}]}