{"keras_version": "1.2.0", "config": [{"config": {"input_dtype": "float32", "arguments": {}, "output_shape_type": "raw", "output_shape": null, "function_type": "lambda", "batch_input_shape": [null, 16, 32, 1], "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001f<ipython-input-15-ccf65a3ee364>\u00da\b<lambda>\u0002\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "name": "lambda_1", "trainable": true}, "class_name": "Lambda"}, {"config": {"W_constraint": null, "activation": "relu", "nb_col": 3, "nb_filter": 8, "name": "convolution2d_1", "trainable": true, "input_dtype": "float32", "init": "glorot_uniform", "bias": true, "batch_input_shape": [null, 16, 32, 1], "b_constraint": null, "W_regularizer": null, "subsample": [1, 1], "dim_ordering": "tf", "b_regularizer": null, "border_mode": "valid", "activity_regularizer": null, "nb_row": 3}, "class_name": "Convolution2D"}, {"config": {"strides": [3, 3], "pool_size": [3, 3], "dim_ordering": "tf", "name": "maxpooling2d_1", "trainable": true, "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"input_dim": 320, "W_constraint": null, "activation": "linear", "b_regularizer": null, "name": "dense_1", "init": "glorot_uniform", "b_constraint": null, "W_regularizer": null, "output_dim": 1, "trainable": true, "activity_regularizer": null, "bias": true}, "class_name": "Dense"}], "class_name": "Sequential"}