{"config": [{"config": {"trainable": true, "name": "lambda_2", "function_type": "lambda", "input_dtype": "float32", "batch_input_shape": [null, 20, 40, 3], "output_shape_type": "raw", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001f<ipython-input-24-e02e1bc394a6>\u00da\b<lambda>\u0002\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape": null, "arguments": {}}, "class_name": "Lambda"}, {"config": {"trainable": true, "activity_regularizer": null, "init": "glorot_uniform", "nb_filter": 16, "border_mode": "same", "W_constraint": null, "nb_row": 8, "b_constraint": null, "nb_col": 8, "name": "convolution2d_4", "W_regularizer": null, "subsample": [4, 4], "activation": "linear", "bias": true, "dim_ordering": "tf", "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_5"}, "class_name": "ELU"}, {"config": {"trainable": true, "activity_regularizer": null, "init": "glorot_uniform", "nb_filter": 32, "border_mode": "same", "W_constraint": null, "nb_row": 5, "b_constraint": null, "nb_col": 5, "name": "convolution2d_5", "W_regularizer": null, "subsample": [2, 2], "activation": "linear", "bias": true, "dim_ordering": "tf", "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_6"}, "class_name": "ELU"}, {"config": {"trainable": true, "activity_regularizer": null, "init": "glorot_uniform", "nb_filter": 64, "border_mode": "same", "W_constraint": null, "nb_row": 5, "b_constraint": null, "nb_col": 5, "name": "convolution2d_6", "W_regularizer": null, "subsample": [2, 2], "activation": "linear", "bias": true, "dim_ordering": "tf", "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "flatten_2"}, "class_name": "Flatten"}, {"config": {"trainable": true, "name": "dropout_3", "p": 0.2}, "class_name": "Dropout"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_7"}, "class_name": "ELU"}, {"config": {"trainable": true, "activity_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "b_constraint": null, "output_dim": 512, "input_dim": 384, "name": "dense_3", "W_regularizer": null, "activation": "linear", "bias": true, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_4", "p": 0.5}, "class_name": "Dropout"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_8"}, "class_name": "ELU"}, {"config": {"trainable": true, "activity_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "b_constraint": null, "output_dim": 1, "input_dim": 512, "name": "dense_4", "W_regularizer": null, "activation": "linear", "bias": true, "b_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.0"}