{"class_name": "Sequential", "keras_version": "1.2.0", "config": [{"class_name": "Lambda", "config": {"function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001f<ipython-input-15-90e162151e18>\u00da\b<lambda>\u0002\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape": null, "name": "lambda_1", "input_dtype": "float32", "output_shape_type": "raw", "arguments": {}, "function_type": "lambda", "batch_input_shape": [null, 16, 32, 1], "trainable": true}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "W_regularizer": null, "name": "convolution2d_1", "b_constraint": null, "activation": "relu", "nb_row": 3, "batch_input_shape": [null, 16, 32, 1], "b_regularizer": null, "subsample": [1, 1], "input_dtype": "float32", "dim_ordering": "tf", "bias": true, "W_constraint": null, "activity_regularizer": null, "border_mode": "valid", "nb_filter": 16, "nb_col": 3, "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "pool_size": [3, 3], "strides": [3, 3], "dim_ordering": "tf", "border_mode": "valid", "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_1", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "W_regularizer": null, "name": "dense_1", "input_dim": 640, "b_constraint": null, "output_dim": 1, "b_regularizer": null, "activation": "linear", "bias": true, "W_constraint": null, "activity_regularizer": null, "trainable": true}}]}