{"config": [{"class_name": "Lambda", "config": {"function_type": "lambda", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001f<ipython-input-28-edce3dff3743>\u00da\b<lambda>\u0002\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "batch_input_shape": [null, 16, 32, 1], "input_dtype": "float32", "name": "lambda_5", "output_shape_type": "raw", "arguments": {}, "output_shape": null, "trainable": true}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "batch_input_shape": [null, 16, 32, 1], "nb_row": 3, "W_constraint": null, "name": "convolution2d_5", "nb_col": 3, "activity_regularizer": null, "init": "glorot_uniform", "subsample": [1, 1], "bias": true, "activation": "relu", "input_dtype": "float32", "b_regularizer": null, "border_mode": "valid", "nb_filter": 2, "trainable": true, "dim_ordering": "tf", "W_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"strides": [4, 4], "pool_size": [4, 4], "border_mode": "valid", "trainable": true, "dim_ordering": "tf", "name": "maxpooling2d_5"}}, {"class_name": "Dropout", "config": {"p": 0.25, "trainable": true, "name": "dropout_5"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_5"}}, {"class_name": "Dense", "config": {"b_constraint": null, "input_dim": 42, "activity_regularizer": null, "name": "dense_5", "output_dim": 1, "W_regularizer": null, "W_constraint": null, "b_regularizer": null, "activation": "linear", "bias": true, "trainable": true, "init": "glorot_uniform"}}], "class_name": "Sequential", "keras_version": "1.2.0"}