{"class_name": "Sequential", "keras_version": "1.2.0", "config": [{"class_name": "Lambda", "config": {"function_type": "lambda", "trainable": true, "arguments": {}, "input_dtype": "float32", "output_shape_type": "raw", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001f<ipython-input-15-87ceb92aece6>\u00da\b<lambda>\u0002\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape": null, "batch_input_shape": [null, 16, 32, 1], "name": "lambda_1"}}, {"class_name": "Convolution2D", "config": {"activation": "relu", "dim_ordering": "tf", "batch_input_shape": [null, 16, 32, 1], "W_regularizer": null, "b_regularizer": null, "bias": true, "nb_row": 3, "name": "convolution2d_1", "nb_col": 3, "init": "glorot_uniform", "trainable": true, "subsample": [1, 1], "nb_filter": 2, "border_mode": "valid", "input_dtype": "float32", "activity_regularizer": null, "W_constraint": null, "b_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [3, 3], "dim_ordering": "tf", "trainable": true, "border_mode": "valid", "strides": [3, 3], "name": "maxpooling2d_1"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_1"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"activation": "linear", "bias": true, "W_regularizer": null, "b_regularizer": null, "output_dim": 1, "input_dim": 80, "name": "dense_1", "init": "glorot_uniform", "trainable": true, "activity_regularizer": null, "W_constraint": null, "b_constraint": null}}]}