{"keras_version": "1.2.0", "class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"output_shape_type": "raw", "name": "lambda_3", "output_shape": null, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001f<ipython-input-30-3ad77e66e45c>\u00da\b<lambda>\u0002\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "input_dtype": "float32", "arguments": {}, "function_type": "lambda", "batch_input_shape": [null, 16, 32, 1], "trainable": true}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "W_constraint": null, "b_regularizer": null, "nb_col": 3, "input_dtype": "float32", "activation": "relu", "nb_row": 3, "activity_regularizer": null, "b_constraint": null, "bias": true, "batch_input_shape": [null, 16, 32, 1], "W_regularizer": null, "border_mode": "valid", "subsample": [1, 1], "dim_ordering": "tf", "nb_filter": 4, "name": "convolution2d_3", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "strides": [3, 3], "dim_ordering": "tf", "trainable": true, "name": "maxpooling2d_3", "pool_size": [3, 3]}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_3", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_3", "trainable": true}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "W_constraint": null, "b_regularizer": null, "activation": "linear", "output_dim": 1, "input_dim": 160, "b_constraint": null, "bias": true, "W_regularizer": null, "activity_regularizer": null, "name": "dense_3", "trainable": true}}]}